[
  {
    "isCurrent": true,
    "icon": "https://cdn.shopify.com/s/files/1/0264/9161/7361/files/logo_omni.png?v=1655440904",
    "title": "Software Engineer - ( Remote )",
    "company": "OCMI workers comp",
    "location": "Miami, FL",
    "duration": "February 24th, 2024 -",
    "description": "I am responsible for developing and maintaining a comprehensive web application that provides a complete management system for workers' compensation claims. The application is designed to manage all aspects of the claims process, including the ability to track and manage claims, generate reports, and provide real-time analytics. I am also responsible for ensuring that the application is scalable, secure, and reliable. I have implemented a range of features, including a comprehensive dashboard, advanced search functionality, and integration with external APIs. I have also developed a range of tools to help streamline the claims process, including automated workflows, document management, and more. I have utilized a range of technologies, including React, Node.js, and MongoDB, to ensure that the application is efficient, reliable, and easy to use.",
    "link": "https://ocmiworkerscomp.com",
    "tags": [
      "Frontend",
      "Backend",
      "API",
      "Development",
      "NestJs",
      "NextJS",
      "MySQL"
    ]
  },
  {
    "isCurrent": true,
    "icon": "https://cdn.shopify.com/s/files/1/0264/9161/7361/files/logo_fox_racing_colombia.png?v=1655440904",
    "title": "CEO & CTO – (Remote, Face-to-face)",
    "company": "Three Labs S.A.S.",
    "location": "Worldwide",
    "duration": "June 1st, 2021 -",
    "description": "As the Chief Executive Officer and Chief Technology Officer at THREE LABS S.A.S., I lead the company’s vision and oversee the execution of a wide range of services spanning custom software development, mobile and web applications, DevOps infrastructure, and digital product strategy. I manage cross-functional teams and ensure delivery excellence across projects involving modern tech stacks such as React, React Native, Node.js, PostgreSQL, and cloud-based solutions. Our services cover e-commerce platforms (Shopify, WooCommerce, WordPress), marketing websites, API development, DevOps automation, and tailor-made applications for startups and enterprises. I’m also directly involved in quality assurance processes, supporting QA automation and testing strategies for mobile and web platforms. By combining technical leadership with a strong product and business mindset, I ensure our solutions are scalable, secure, and aligned with client goals. Our team focuses on building innovative, full-stack experiences that drive real impact.",
    "link": "https://www.threeelabs.com",
    "tags": [
      "Mobile",
      "Fullstack",
      "NestJS",
      "NodeJS",
      "PostgreSQL",
      "React",
      "QA",
      "API",
      "Devops",
      "E-commerce",
      "Shopify",
      "NextJS",
      "React Native",
      "Astro",
      "WordPress",
      "Supabase",
      "Neon"
    ]
  },
  {
    "isCurrent": false,
    "icon": "https://cdn.shopify.com/s/files/1/0264/9161/7361/files/logo_fox_racing_colombia.png?v=1655440904",
    "title": "Software Engineer - ( Remote, Face-to-face )",
    "company": "Fox Racing Colombia",
    "location": "Bogotá, Colombia",
    "duration": "June 1nd, 2021 - February 28th, 2025",
    "description": "I designed and developed a comprehensive API to manage inventory, orders, branches, sales details, and more. The application allows downloading reports and real-time statistics, in addition to advanced analytics. We implemented integration with external APIs for extended functionality and ensured efficient server handling. This project was carried out using the MERN stack, ensuring a comprehensive and consistent approach from front-end to back-end. The resulting solution is authentic, providing effective and real-time management of essential business operations.",
    "link": "https://www.foxracing.com",
    "tags": [
      "Frontend",
      "Backend",
      "MERN",
      "API",
      "Devops",
      "E-commerce",
      "Development",
      "Shopify",
      "NextJS"
    ]
  },
  {
    "isCurrent": true,
    "title": "Software Engineer - ( Remote) ",
    "company": "Kevnnard Labs",
    "location": "Worldwide",
    "duration": "January 1nd, 2021 -",
    "description": "As a specialist in software and web development, I lead an agency focused on executing personal projects for web and mobile devices. We utilize modern stacks and agile technologies to achieve efficient and cutting-edge results. You can review all our projects on my GitHub repository, providing complete transparency about our development process. We stand out for being authentic and innovative, delivering high-quality solutions that meet our clients' expectations.",
    "link": "https://kevnnard.com",
    "tags": [
      "Mobile",
      "Frontend",
      "Backend",
      "React Native",
      "NextJS",
      "Shopify",
      "Devops",
      "FULLSTACK",
      "Freelance"
    ]
  }
]
